Repository: krxton/Skill-Wallet-Kool
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: th

# welcome_playBtn
source: PLAY
th: เริ่มเล่น

# welcome_signUpBtn
source: SIGN-UP
th: สมาชิกใหม่?

# welcome_signInBtn
source: LOG IN
th: เข้าสู่ระบบ

# home_categoryBtn
source: CATEGORY
th: เลือกหมวดหมู่

# home_physicalBtn
source: PHYSICAL
th: ด้านร่างกาย

# home_languageBtn
source: LANGUAGE
th: ด้านภาษา

# home_calculationBtn
source: CALCULATION
th: ด้านการคำนวณ

# home_cannotBtn
source: Cannot load popular activities
th: ไม่สามารถโหลดกิจกรรมยอดนิยมได้

# home_nonewBtn
source: No new activities available
th: ไม่มีกิจกรรมใหม่เกิดขึ้น

# home_noChildrenMsg
source: No children added yet. Please add a child to start viewing activities.
th: ยังไม่ได้เพิ่มลูก กรุณาเพิ่มลูกเพื่อเริ่มดูกิจกรรม

# home_popularactivityBtn
source: POPULAR ACTIVITIES
th: กิจกรรมยอดนิยม

# home_newactivityBtn
source: NEW ACTIVITIES
th: กิจกรรมใหม่

# home_viewallBtn
source: View All
th: ดูทั้งหมด

# home_searchBtn
source: SEARCH
th: ค้นหา...

# home_bannerLanguage
source: LANGUAGE TRAINING
th: ฝึกภาษา

# home_bannerCalculate
source: CALCULATE
th: คิดเลข

# home_bannerProblems
source: PROBLEMS SOLVE
th: แก้ปัญหา

# home_filterTitle
source: FILTER ACTIVITIES
th: กรองกิจกรรม

# home_filterCategory
source: CATEGORY
th: หมวดหมู่

# home_filterLevel
source: LEVEL
th: ระดับ

# home_filterAll
source: ALL
th: ทั้งหมด

# home_filterEasy
source: EASY
th: ง่าย

# home_filterMedium
source: MEDIUM
th: กลาง

# home_filterHard
source: HARD
th: ยาก

# home_suggested
source: SUGGESTED
th: แนะนำ

# parentprofile_postBtn
source: POST
th: โพสต์

# register_backBtn
source: BACK
th: ย้อนกลับ

# register_signuptoBtn
source: SIGN-UP TO
th: ลงทะเบียนเข้าสู่

# register_facebookBtn
source: CONTINUE WITH FACEBOOK
th: ดำเนินการต่อด้วย FACEBOOK

# register_googleBtn
source: CONTINUE WITH GOOGLE
th: ดำเนินการต่อด้วย GOOGLE

# register_nextBtn
source: NEXT
th: ต่อไป

# register_registerBtn
source: REGISTER
th: ลงทะเบียน

# register_additionalBtn
source: ADDITIONAL INFORMATION
th: ข้อมูลเพิ่มเติม

# register_namesurnamechildBtn
source: NAME & SURNAME (CHILDREN) {index}
th: ชื่อและนามสกุลคนที่ {index}

# register_birthdayBtn
source: BIRTHDAY : DD/MM/YYYY
th: วันเกิด : วว/ดด/ปปปป

# register_okBtn
source: OK
th: เสร็จสิ้น

# register_pls
source: Please fill in all the information in the list.
th: กรอกข้อมูลให้ครบในรายการที่

# register_finish
source: Successfully registered!
th: ลงทะเบียนสำเร็จ!

# register_relation
source: RELATION
th: ความสัมพันธ์

# register_pickbirthday
source: Choose birthday
th: เลือกวันเกิด

# register_Anerroroccurredplstry
source: An error occurred. Please try again.
th: เกิดข้อผิดพลาด กรุณาลองอีกครั้ง

# register_Anerroroccurred
source: An error occurred: {index}
th: เกิดข้อผิดพลาด: {index}

# register_sus
source: Registration successful! Added {index} child.
th: ลงทะเบียนสำเร็จ! เพิ่มลูก {index} คน

# register_submitterror
source: Submit error: {index}
th: ส่งผิดพลาด: {index}

# register_requiredinformation
source: Please fill in all the required information (name, date of birth, relationship) in the list. {index}
th: กรอกข้อมูลให้ครบ (ชื่อ, วันเกิด, ความสัมพันธ์) ในรายการที่ {index}

# login_backBtn
source: BACK
th: ย้อนกลับ

# login_facebookBtn
source: CONTINUE WITH FACEBOOK
th: ดำเนินการต่อด้วย FACEBOOK

# login_googleBtn
source: CONTINUE WITH GOOGLE
th: ดำเนินการต่อด้วย GOOGLE

# login_loading
source: Signing in...
th: กำลังเข้าสู่ระบบ...

# login_noAccount
source: No account found. Please register first.
th: ไม่พบบัญชีผู้ใช้ กรุณาลงทะเบียนก่อน

# login_goToRegister
source: GO TO REGISTER
th: ไปลงทะเบียน

# register_loading
source: Registering...
th: กำลังลงทะเบียน...

# register_alreadyExists
source: This account is already registered. Please login instead.
th: บัญชีนี้ลงทะเบียนแล้ว กรุณาเข้าสู่ระบบแทน

# register_goToLogin
source: GO TO LOGIN
th: ไปเข้าสู่ระบบ

# auth_termsAgree
source: I have read and agree to the
th: ฉันได้อ่านและยอมรับ

# auth_termsOfService
source: Terms of Service
th: ข้อตกลงการใช้บริการ

# auth_privacyPolicy
source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# auth_and
source: and
th: และ

# auth_pleaseAgreeTerms
source: Please agree to the Terms of Service and Privacy Policy first.
th: กรุณายอมรับข้อตกลงการใช้บริการและนโยบายความเป็นส่วนตัวก่อน

# auth_loading
source: Signing in...
th: กำลังเข้าสู่ระบบ...

# auth_tosDialogMsg
source: To ensure things are in your best interests, please review the Terms of Service and then choose to enter.
th: เพื่อให้มั่นใจว่าสิ่งต่างๆ เป็นไปเพื่อประโยชน์ของคุณ กรุณาอ่านข้อตกลงการใช้บริการก่อนเลือกเข้าใช้งาน

# auth_readTos
source: Read TOS
th: อ่านข้อตกลง

# auth_enter
source: Enter
th: เข้าใช้งาน

# setting_backBtn
source: BACK
th: ย้อนกลับ

# setting_settingBtn
source: SETTING
th: การตั้งค่า

# setting_personalBtn
source: PERSONAL INFORMATION
th: ข้อมูลส่วนตัว

# setting_generalBtn
source: GENERAL
th: ทั่วไป

# setting_profileBtn
source: PROFILE
th: โปรไฟล์

# setting_childBtn
source: CHILD
th: เด็ก

# setting_notificationBtn
source: NOTIFICATIONS
th: การแจ้งเตือน

# setting_thaiBtn
source: THAI
th: ภาษาไทย

# setting_englishBtn
source: ENGLISH
th: ภาษาอังกฤษ

# setting_logoutBtn
source: LOG OUT
th: ลงชื่อออก

# setting_deleteAccountBtn
source: DELETE ACCOUNT
th: ลบบัญชี

# setting_deleteTitle
source: Delete Account?
th: ลบบัญชีหรือไม่?

# setting_deleteMsg
source: This will permanently delete your account and all children data. Your data will be removed within 30 days. This action cannot be undone.
th: การดำเนินการนี้จะลบบัญชีและข้อมูลลูกทั้งหมดอย่างถาวร ข้อมูลจะถูกลบภายใน 30 วัน และไม่สามารถกู้คืนได้

# setting_deleteConfirm
source: DELETE
th: ลบบัญชี

# setting_deleteSuccess
source: Account deleted successfully.
th: ลบบัญชีสำเร็จแล้ว

# setting_deleteError
source: Failed to delete account. Please try again.
th: ไม่สามารถลบบัญชีได้ กรุณาลองใหม่อีกครั้ง

# namesetting_changenameBtn
source: CHANGE NAME
th: เปลี่ยนชื่อ

# namesetting_enternewnameBtn
source: ENTER NEW NAME
th: กรุณากรอกชื่อใหม่

# namesetting_hint
source: Type your name...
th: พิมพ์ชื่อของคุณ...

# namesetting_saveBtn
source: SAVE
th: บันทึก

# profilesetting_nameBtn
source: NAME
th: ชื่อ

# profilesetting_deleteaccoutBtn
source: DELETE ACCOUNT
th: ลบบัญชี

# profileSet_deleteDialogTitle
source: DELETE ACCOUNT?
th: ยืนยันการลบบัญชี

# profilesetting_areusureBtn
source: Are you sure you want to delete your account? This action cannot be undone.
th: คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีของคุณ? การกระทำนี้ไม่สามารถย้อนกลับได้

# profilesetting_cancelBtn
source: CANCEL
th: ยกเลิก

# profilesetting_deleteBtn
source: DELETE
th: ลบบัญชี

# childprofile_mathGame
source: MATH GAME
th: เกมคณิตศาสตร์

# childprofile_workoutGame
source: WORK OUT GAME
th: เกมออกกำลังกาย

# childsetting_childsettingBtn
source: CHILD SETTING
th: การตั้งค่าเด็ก

# childsetting_scoreBtn
source: SCORE
th: คะแนน

# childsetting_viewprofileBtn
source: VIEW PROFILE
th: ดูโปรไฟล์

# childsetting_manageBtn
source: MANAGE
th: จัดการ

# childgallery_title
source: MY GALLERY
th: แกลเลอรีของฉัน

# childgallery_empty
source: NO POSTS YET
th: ยังไม่มีรูปภาพ

# history_timesSuffix
source: TIMES
th: ครั้ง

# result_title
source: PLAYING RESULT
th: ผลการเล่น

# result_timeUsedTitle
source: TIME USED
th: เวลาที่ใช้

# redemption_playBtn
source: PLAY
th: เล่น

# redemption_rewardIceCream
source: ICE CREAM
th: ไอศกรีม

# redemption_rewardPlaytime
source: 1 HR PLAYTIME
th: เล่นเกม 1 ชม.

# redemption_rewardToy
source: NEW TOY
th: ของเล่นใหม่

# redemption_rewardStickers
source: STICKERS
th: สติ๊กเกอร์

# redemption_historyPlayedDefault
source: Played Ping Pong
th: เล่นปิงปอง

# redemption_historyRedeemedDefault
source: Redeemed Ice Cream
th: แลกไอศกรีม

# dialog_deleteTitle
source: Delete Profile?
th: ลบโปรไฟล์?

# dialog_deleteContent
source: Are you sure you want to delete this profile? This action cannot be undone.
th: คุณแน่ใจหรือไม่ที่จะลบโปรไฟล์นี้? การกระทำนี้ไม่สามารถย้อนกลับได้

# dialog_confirmDelete
source: DELETE
th: ลบ

# dialog_cancel
source: CANCEL
th: ยกเลิก

# dialog_saveSuccess
source: Saved successfully!
th: บันทึกสำเร็จ!

# notificationsetting_notificationBtn
source: NOTIFICATIONS
th: การแจ้งเตือน

# notificationsetting_allnotificationBtn
source: ALL NOTIFICATIONS
th: การแจ้งเตือนทั้งหมด

# notificationsetting_postBtn
source: POST
th: โพสต์

# notificationsetting_likeBtn
source: LIKE
th: การถูกใจ

# notificationsetting_commentBtn
source: COMMENT
th: การแสดงความคิดเห็น

# videodetail_activitynameBtn
source: ACTIVITY NAME
th: ชื่อกิจกรรม

# videodetail_nameBtn
source: name
th: ชื่อ

# videodetail_DescriptionBtn
source: DESCRIPTION
th: คำอธิบาย

# videodetail_descriptionBtn
source: description
th: คำอธิบาย

# videodetail_howtoplayBtn
source: HOW TO PLAY / INSTRUCTIONS:
th: วิธีเล่น / คำแนะนำ:

# videodetail_contentBtn
source: content
th: เนื้อหา

# videodetail_startBtn
source: START
th: เริ่ม

# videodetail_addBtn
source: ADD
th: เพิ่ม

# addchild_namesurnameBtn
source: NAME & SURNAME (CHILDREN)
th: ชื่อและนามสกุล (เด็ก)

# addchild_errorName
source: Please enter a name
th: กรุณาระบุชื่อ

# addchild_birthdayBtn
source: BIRTHDAY : DD/MM/YYYY
th: วันเกิด : วว/ดด/ปปปป

# addchild_logoutTitle
source: Log out?
th: ออกจากระบบ?

# addchild_logoutMsg
source: Please add at least one child to use the app. Are you sure you want to log out?
th: กรุณาเพิ่มลูกอย่างน้อย 1 คนก่อนใช้งานแอป คุณต้องการออกจากระบบหรือไม่?

# addchild_errorRequiredFields
source: Please fill in all required fields (name, birthday, relationship).
th: กรุณากรอกข้อมูลให้ครบทุกช่อง (ชื่อ, วันเกิด, ความสัมพันธ์)

# childnamesetting_editnameBtn
source: EDIT NAME
th: แก้ไขชื่อ

# childnamesetting_saveBtn
source: SAVE
th: บันทึก

# managechild_manageprofileBtn
source: MANAGE PROFILE
th: จัดการโปรไฟล์

# managechild_nameBtn
source: NAME
th: ชื่อ

# managechild_medalsandredemptionBtn
source: MEDALS & REDEMPTION
th: รางวัลและการแลกรางวัล

# managechild_deleteprofileBtn
source: DELETE PROFILE
th: ลบโปรไฟล์

# dairyactivity_playhistoryBtn
source: PLAYING HISTORY
th: ประวัติการเล่น

# dairyactivity_timeBtn
source: time
th: เวลา

# dairyactivity_medalsBtn
source: medals
th: รางวัล

# medalredemption_addrewardBtn
source: ADD AGREEMENT
th: เพิ่มข้อตกลง

# medalredemption_rewardnameBtn
source: Agreement Name
th: ชื่อข้อตกลง

# medalredemption_costBtn
source: Cost (Points)
th: คะแนน

# medalredemption_cancelBtn
source: CANCEL
th: ยกเลิก

# medalredemption_addBtn
source: ADD
th: เพิ่ม

# medalredemption_redemptionBtn
source: AGREEMENTS
th: ข้อตกลง

# medalredemption_activitiesBtn
source: ACTIVITIES
th: กิจกรรม

# medalredemption_currentscoreBtn
source: CURRENT SCORE
th: คะแนนปัจจุบัน

# medalredemption_rewardshopBtn
source: AGREEMENTS
th: ข้อตกลง

# medalredemption_successfullyBtn
source: Successfully Redeemed
th: แลกรางวัลสำเร็จ

# agreement_typeTime
source: Time
th: เวลา

# agreement_typeItem
source: Item
th: สิ่งของ

# agreement_typePrivilege
source: Privilege
th: สิทธิพิเศษ

# agreement_typeFamily
source: Family
th: กิจกรรมครอบครัว

# agreement_selectType
source: Select Agreement Type
th: เลือกประเภทข้อตกลง

# agreement_confirmTitle
source: Confirm Agreement
th: ยืนยันข้อตกลง

# agreement_confirmMsg
source: Use {cost} points to redeem "{name}"?
th: ใช้ {cost} คะแนนเพื่อแลก "{name}"?

# agreement_confirmBtn
source: CONFIRM
th: ยืนยัน

# agreement_sessionActive
source: Session Active
th: กำลังใช้งาน

# agreement_timeRemaining
source: Time Remaining
th: เวลาที่เหลือ

# agreement_startTimer
source: START
th: เริ่ม

# agreement_stopTimer
source: STOP
th: หยุด

# agreement_endSession
source: END SESSION
th: สิ้นสุดการใช้งาน

# agreement_sessionComplete
source: Session Complete!
th: เสร็จสิ้น!

# agreement_behaviorTitle
source: How was the behavior?
th: พฤติกรรมเป็นอย่างไร?

# agreement_behaviorGood
source: Good
th: ดี

# agreement_behaviorOk
source: OK
th: ปกติ

# agreement_behaviorBad
source: Needs Improvement
th: ต้องปรับปรุง

# agreement_bonusMsg
source: Bonus: +{points} points
th: โบนัส: +{points} คะแนน

# agreement_deductMsg
source: Deduction: -{points} points
th: หัก: -{points} คะแนน

# agreement_noChange
source: No point change
th: ไม่มีการเปลี่ยนแปลงคะแนน

# agreement_notEnoughPoints
source: Not enough points! Need {needed} more.
th: คะแนนไม่เพียงพอ! ต้องการอีก {needed} คะแนน

# agreement_durationLabel
source: Duration (minutes)
th: ระยะเวลา (นาที)

# agreement_emptyList
source: No agreements yet
th: ยังไม่มีข้อตกลง

# agreement_emptyHint
source: Tap + to create a new agreement
th: กด + เพื่อสร้างข้อตกลงใหม่

# videodetail_videoNotAvailable
source: Video Not Available (HTML Content Missing)
th: ไม่สามารถเล่นวิดีโอได้ (ไม่มีเนื้อหา HTML)

# videodetail_activityNameLabel
source: ACTIVITY NAME:
th: ชื่อกิจกรรม:

# videodetail_descriptionLabel
source: DESCRIPTION:
th: รายละเอียด:

# videodetail_howToPlayLabel
source: HOW TO PLAY / INSTRUCTIONS:
th: วิธีการเล่น / คำแนะนำ:

# videodetail_categoryPrefix
source: Category:
th: หมวดหมู่:

# videodetail_difficultyPrefix
source: Difficulty:
th: ความยาก:

# videodetail_maxScorePrefix
source: Max Score:
th: คะแนนสูงสุด:

# physical_snackNoEvidence
source: Please attach video or image evidence.
th: กรุณาแนบวิดีโอหรือรูปภาพหลักฐาน

# physical_snackInvalidScore
source: Please set a valid score (1 to {maxScore}).
th: กรุณาระบุคะแนนให้ถูกต้อง (1 ถึง {maxScore})

# physical_dialogSubmitTitle
source: Submission Complete!
th: ส่งข้อมูลเรียบร้อย!

# physical_dialogSubmitContent
source: Your evidence has been submitted for approval.
th: หลักฐานของคุณถูกส่งเพื่อรอการอนุมัติแล้ว

# physical_dialogOkBtn
source: OK
th: ตกลง

# physical_snackSubmitError
source: Submission Error: {error}
th: เกิดข้อผิดพลาดในการส่ง: {error}

# physical_dialogEnterScoreTitle
source: Enter Score
th: ระบุคะแนน

# physical_dialogEnterScoreHint
source: Enter score (1-{maxScore})
th: ใส่คะแนน (1-{maxScore})

# physical_dialogCancelBtn
source: Cancel
th: ยกเลิก

# physical_snackInvalidInput
source: Please enter a valid score (0-{maxScore})
th: กรุณาใส่คะแนนให้ถูกต้อง (0-{maxScore})

# physical_stopBtn
source: STOP
th: หยุด

# physical_startBtn
source: START
th: เริ่ม

# physical_takePhotoBtn
source: TAKE PHOTO
th: ถ่ายรูป

# physical_medalsScoreLabel
source: MEDALS / SCORE
th: เหรียญรางวัล / คะแนน

# physical_diaryLabel
source: DIARY
th: บันทึกประจำวัน

# physical_diaryHint
source: Enter notes here...
th: เขียนบันทึกที่นี่...

# physical_imageEvidenceLabel
source: IMAGE EVIDENCE
th: หลักฐานรูปภาพ

# physical_videoEvidenceLabel
source: VIDEO EVIDENCE
th: หลักฐานวิดีโอ

# physical_timeLabel
source: TIME
th: เวลา

# physical_submittingBtn
source: Submitting...
th: กำลังส่งข้อมูล...

# physical_finishBtn
source: FINISH
th: เสร็จสิ้น

# physical_addChildren
source: Add Children
th: เพิ่มเด็ก

# physical_addChildrenDesc
source: Select children to play together
th: เลือกเด็กที่จะเล่นด้วยกัน

# physical_childrenAdded
source: +{count} children
th: +{count} คน

# physical_currentChild
source: Currently playing
th: กำลังเล่นอยู่

# physical_confirm
source: Confirm
th: ยืนยัน

# languagedetail_titlePrefix
source: LANGUAGE:
th: ภาษา:

# languagedetail_categoryPrefix
source: CATEGORY:
th: หมวดหมู่:

# languagedetail_activityTitleLabel
source: ACTIVITY TITLE
th: หัวข้อกิจกรรม

# languagedetail_descriptionLabel
source: DESCRIPTION
th: รายละเอียด

# languagedetail_difficultyPrefix
source: Difficulty:
th: ความยาก:

# languagedetail_maxScorePrefix
source: Max Score:
th: คะแนนสูงสุด:

# languagedetail_startBtn
source: START
th: เริ่ม

# itemintro_recordToEnable
source: Record to enable playback
th: กดบันทึกเสียงเพื่อฟังเสียงของคุณ

# itemintro_listenExampleBtn
source: LISTEN TO EXAMPLE
th: ฟังตัวอย่าง

# itemintro_practiceNowBtn
source: PRACTICE NOW
th: เริ่มฝึกทันที

# itemintro_submitBtn
source: SUBMIT
th: ส่งผลงาน

# itemintro_playsection
source: PLAY SECTION
th: เล่นข้อความ

# itemintro_record
source: RECORD
th: บันทึก

# itemintro_casttotv
source: CAST TO TV
th: ส่งไปยังทีวี

# itemintro_airplay
source: AIRPLAY
th: เล่นทางอากาศ

# itemintro_previous
source: < PREVIOUS
th: < ก่อนหน้า

# itemintro_next
source: NEXT >
th: ถัดไป >

# itemintro_finish
source: FINISH >
th: เสร็จสิ้น >

# itemintro_Videonotavailable
source: Video not available
th: ไม่มีวิดีโอ

# record_loading
source: Loading...
th: กำลังโหลด...

# record_finishBtn
source: FINISH
th: เสร็จสิ้น

# record_errorMic
source: Microphone error or permission denied
th: เกิดข้อผิดพลาดหรือไมโครโฟนไม่ได้รับอนุญาต

# record_statusRecording
source: Recording...
th: กำลังบันทึกเสียง...

# record_statusIdle
source: Press mic to record
th: กดไมค์เพื่อเริ่มอัดเสียง

# result_activityCompletedDefault
source: ACTIVITY COMPLETED
th: กิจกรรมเสร็จสมบูรณ์

# result_greatJobTitle
source: GREAT JOB!
th: ยอดเยี่ยมมาก!

# result_totalScoreLabel
source: Total Score
th: คะแนนรวม

# result_timeSpentLabel
source: Time Spent
th: เวลาที่ใช้

# result_retryBtn
source: RETRY
th: ลองใหม่

# result_backToActivitiesBtn
source: BACK TO ACTIVITIES
th: กลับไปหน้ากิจกรรม

# result_returnHomeBtn
source: RETURN HOME
th: กลับหน้าหลัก

# result_timeFormat
source: {minutes} min {seconds} sec
th: {minutes} นาที {seconds} วินาที

# calculate_title
source: CALCULATE
th: คำนวณ

# calculate_plusBtn
source: PLUS +
th: บวก +

# calculate_minusBtn
source: MINUS -
th: ลบ -

# calculate_multiplyBtn
source: MULTIPLY *
th: คูณ *

# calculate_divideBtn
source: DEVIDE /
th: หาร /

# calculate_mixBtn
source: MIX + - * /
th: ผสม + - * /

# calculate_problemsSolveBtn
source: PROBLEMS SOLVE
th: โจทย์ปัญหา

# languagehub_searchHint
source: search...
th: ค้นหา...

# languagehub_trainingTitle
source: LANGUAGE TRAINING
th: ฝึกฝนภาษา

# languagehub_listeningSpeakingTitle
source: LISTENING AND SPEAKING
th: การฟังและการพูด

# languagehub_easyBtn
source: EASY
th: ง่าย

# languagehub_mediumBtn
source: MEDIUM
th: ปานกลาง

# languagehub_difficultBtn
source: DIFFICULT
th: ยาก

# plus_castToTvBtn
source: CAST TO TV
th: ขึ้นจอทีวี

# plus_answerBtn
source: ANSWER
th: ดูเฉลย

# problemdetail_title
source: PROBLEMS SOLVE
th: โจทย์ปัญหา

# problemdetail_castToTvBtn
source: CAST TO TV
th: ขึ้นจอทีวี

# problemdetail_answerBtn
source: ANSWER
th: ดูเฉลย

# problemanswer_title
source: ANSWER
th: เฉลย

# problemanswer_defaultQuestion
source: THERE ARE 6 CATS IN THE FIELD. ANOTHER 2 CATS WALK INTO THE FIELD. HOW MANY CATS ARE THERE IN TOTAL ?
th: มีแมว 6 ตัวในสนาม เดินเข้ามาอีก 2 ตัว รวมมีแมวทั้งหมดกี่ตัว ?

# problemanswer_defaultAnswer
source: THERE ARE 8 CATS IN TOTAL.
th: รวมมีแมวทั้งหมด 8 ตัว

# problemplaying_finishBtn
source: FINISH
th: เสร็จสิ้น

# createpost_sharesus
source: Post shared successfully!
th: แชร์โพสต์เรียบร้อย!

# createpost_error
source: An error occurred:
th: เกิดข้อผิดพลาด:

# createpost_newpost
source: New post
th: โพสต์ใหม่

# createpost_share
source: Share
th: แชร์

# createpost_picksomepicture
source: Tap to select a picture
th: แตะเพื่อเลือกรูป

# createpost_changepic
source: Change picture
th: เปลี่ยนรูป

# createpost_writecaption
source: Write a caption...
th: เขียนคำบรรยาย...

# languagelist_snackNotConnected
source: This flow is not connected to activities yet.
th: ส่วนนี้ยังไม่ได้เชื่อมต่อกับกิจกรรมจริง

# common_categoryLabel
source: Category
th: หมวดหมู่

# common_difficultyLabel
source: Difficulty
th: ความยาก

# common_maxScoreLabel
source: Max Score
th: คะแนนสูงสุด

# common_categoryLanguage
source: Language
th: ด้านภาษา

# common_categoryPhysical
source: Physical
th: ด้านร่างกาย

# common_categoryCalculate
source: Calculate
th: ด้านคำนวณ

# common_activityLanguage
source: Language Activity
th: กิจกรรมภาษา

# common_activityPhysical
source: Physical Activity
th: กิจกรรมร่างกาย

# common_activityCalculate
source: Calculation Activity
th: กิจกรรมคำนวณ

# common_difficultyEasy
source: Easy
th: ง่าย

# common_difficultyMedium
source: Medium
th: ปานกลาง

# common_difficultyHard
source: Hard
th: ยาก

# createActivity_title
source: CREATE ACTIVITY
th: สร้างกิจกรรม

# createActivity_selectCategory
source: Select Category
th: เลือกหมวดหมู่

# createActivity_physical
source: Physical
th: ด้านร่างกาย

# createActivity_calculate
source: Calculate
th: ด้านคำนวณ

# createActivity_name
source: Activity Name
th: ชื่อกิจกรรม

# createActivity_description
source: Description
th: คำอธิบาย

# createActivity_content
source: How to Play / Instructions
th: วิธีเล่น / คำแนะนำ

# createActivity_difficulty
source: Difficulty
th: ระดับความยาก

# createActivity_maxScore
source: Max Score
th: คะแนนสูงสุด

# createActivity_videoUrl
source: Video URL (TikTok)
th: URL วิดีโอ (TikTok)

# createActivity_addQuestion
source: Add Question
th: เพิ่มโจทย์

# createActivity_question
source: Question
th: คำถาม

# createActivity_answer
source: Answer
th: คำตอบ

# createActivity_solution
source: Solution / Explanation
th: วิธีทำ / อธิบาย

# createActivity_score
source: Score
th: คะแนน

# createActivity_submit
source: CREATE
th: สร้าง

# createActivity_success
source: Activity created successfully!
th: สร้างกิจกรรมสำเร็จ!

# createActivity_error
source: Failed to create activity
th: ไม่สามารถสร้างกิจกรรมได้

# createActivity_nameRequired
source: Please enter an activity name
th: กรุณาระบุชื่อกิจกรรม

# createActivity_contentRequired
source: Please enter instructions
th: กรุณาระบุวิธีเล่น

# createActivity_needQuestions
source: Please add at least one question
th: กรุณาเพิ่มโจทย์อย่างน้อย 1 ข้อ

# createActivity_questionNo
source: Question {index}
th: โจทย์ที่ {index}

# createActivity_removeQuestion
source: Remove
th: ลบ

# createActivity_creating
source: Creating...
th: กำลังสร้าง...

# profile_myActivities
source: MY ACTIVITIES
th: กิจกรรมของฉัน

# profile_noActivities
source: No activities yet
th: ยังไม่มีกิจกรรม

# profile_editActivity
source: Edit Activity
th: แก้ไขกิจกรรม

# profile_deleteActivity
source: Delete Activity
th: ลบกิจกรรม

# profile_deleteConfirm
source: Are you sure you want to delete "{name}"?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ "{name}"?

# profile_deleteSuccess
source: Activity deleted
th: ลบกิจกรรมแล้ว

# profile_updateSuccess
source: Activity updated
th: อัปเดตกิจกรรมแล้ว

# profile_save
source: SAVE
th: บันทึก

# profile_manage
source: MANAGE
th: จัดการ

# share_title
source: SHARE RESULT
th: แชร์ผลลัพธ์

# share_asImage
source: Image
th: รูปภาพ

# share_asText
source: Text
th: ข้อความ

# share_greatJob
source: GREAT JOB!
th: ยอดเยี่ยม!

# share_keepTrying
source: KEEP TRYING!
th: สู้ต่อไป!

# share_textTemplate
source: I scored {score}/{maxScore} on "{activityName}" in Skill Wallet Kool!
th: ฉันได้ {score}/{maxScore} คะแนนจากกิจกรรม "{activityName}" ใน Skill Wallet Kool!

# common_loginFailed
source: Login failed. Please try again.
th: เข้าสู่ระบบไม่สำเร็จ กรุณาลองอีกครั้ง

# common_errorGeneric
source: Error: {msg}
th: ข้อผิดพลาด: {msg}

# common_processing
source: Processing...
th: กำลังดำเนินการ...

# common_retry
source: Retry
th: ลองอีกครั้ง

# common_cancel
source: Cancel
th: ยกเลิก

# common_close
source: Close
th: ปิด

# calculate_restartTitle
source: Restart?
th: เริ่มใหม่?

# calculate_restartMsg
source: Time and answers will be reset
th: เวลาและคำตอบจะถูกรีเซ็ต

# calculate_restartBtn
source: Restart
th: เริ่มใหม่

# calculate_solutionTitle
source: Answer #{index}
th: ข้อที่ #{index}

# calculate_questionLabel
source: Question:
th: โจทย์:

# calculate_answerLabel
source: Answer:
th: คำตอบ:

# calculate_pressStart
source: Press START button to begin timing
th: กดปุ่มเริ่มเพื่อจับเวลา

# calculate_questionsAfterTimer
source: Questions will appear after timing completes
th: โจทย์จะแสดงหลังจากจับเวลาเสร็จ

# calculate_failedPickFile
source: Failed to pick file: {error}
th: เลือกไฟล์ไม่สำเร็จ: {error}

# calculate_childIdNotFound
source: Child ID not found. Please login again.
th: ไม่พบรหัสเด็ก กรุณาเข้าสู่ระบบอีกครั้ง

# calculate_errorCompleting
source: Error completing activity: {error}
th: เกิดข้อผิดพลาดในการทำกิจกรรม: {error}

# itemintro_videoLoading
source: Please wait. Video is loading...
th: กรุณารอสักครู่ กำลังโหลดวิดีโอ...
