Repository: krxton/Skill-Wallet-Kool
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: th

# itemintro_timingIncomplete
source: Timing data for this sentence is incomplete
th: ข้อมูลเวลาสำหรับประโยคนี้ไม่สมบูรณ์

# itemintro_videoPlayError
source: Cannot play video: {error}
th: ไม่สามารถเล่นวิดีโอได้: {error}

# itemintro_micPermission
source: Please allow microphone access
th: กรุณาอนุญาตการเข้าถึงไมโครโฟน

# itemintro_recordStartError
source: Cannot start recording: {error}
th: ไม่สามารถเริ่มบันทึกเสียงได้: {error}

# itemintro_recordTooShort
source: Recording too short. Please try again
th: บันทึกเสียงสั้นเกินไป กรุณาลองอีกครั้ง

# itemintro_evalResult
source: Evaluation result: {score}% - "{text}"
th: ผลการประเมิน: {score}% - "{text}"

# itemintro_questError
source: Error completing quest: {error}
th: เกิดข้อผิดพลาดในการทำกิจกรรม: {error}

# itemintro_playbackFailed
source: Failed to play back recording.
th: ไม่สามารถเล่นเสียงที่บันทึกได้

# record_micDenied
source: Microphone permission denied.
th: ไม่ได้รับอนุญาตให้ใช้ไมโครโฟน

# record_recordingFailed
source: Recording failed.
th: การบันทึกเสียงล้มเหลว

# record_playbackFailed
source: Failed to play audio.
th: ไม่สามารถเล่นเสียงได้

# record_noValidAudio
source: Error: No valid audio recorded.
th: ข้อผิดพลาด: ไม่มีเสียงที่บันทึกไว้

# record_aiError
source: AI Error: {error}
th: ข้อผิดพลาด AI: {error}

# medals_noActivityHistory
source: No activity history
th: ไม่มีประวัติกิจกรรม

# medals_noHistory
source: No history
th: ไม่มีประวัติ

# post_noComments
source: No comments yet. Be the first!
th: ยังไม่มีความคิดเห็น เป็นคนแรกเลย!

# namesetting_saveFailed
source: Cannot save name. Please try again.
th: ไม่สามารถบันทึกชื่อได้ กรุณาลองอีกครั้ง

# activityCard_selectChild
source: Please select a child
th: กรุณาเลือกเด็ก

# activityCard_selectChildMsg
source: You must select a child before playing activities
th: คุณต้องเลือกเด็กก่อนจึงจะสามารถเล่นกิจกรรมได้

# activityCard_goSelect
source: Go select child
th: ไปเลือกเด็ก

# childsetting_addSuccess
source: Child added successfully
th: เพิ่มเด็กสำเร็จ

# childsetting_deleteSuccess
source: Child deleted successfully
th: ลบเด็กสำเร็จ

# childsetting_selectSuccess
source: Child selected successfully
th: เลือกเด็กสำเร็จ

# childsetting_noChildren
source: No children in system
th: ยังไม่มีเด็กในระบบ

# childsetting_addChild
source: Add child
th: เพิ่มเด็ก

# childsetting_active
source: ACTIVE
th: กำลังใช้งาน

# childsetting_select
source: SELECT
th: เลือก

# common_selectSource
source: Select Source
th: เลือกแหล่ง

# common_camera
source: Camera
th: กล้อง

# common_gallery
source: Gallery
th: แกลเลอรี

# common_ok
source: OK
th: ตกลง

# common_submit
source: SUBMIT
th: ส่ง

# common_addImage
source: Add Image
th: เพิ่มรูป

# common_addVideo
source: Add Video
th: เพิ่มวิดีโอ

# common_videoAdded
source: Video Added
th: เพิ่มวิดีโอแล้ว

# common_image
source: IMAGE
th: รูปภาพ

# common_video
source: VIDEO
th: วิดีโอ

# common_howToPlay
source: HOW TO PLAY
th: วิธีเล่น

# common_questions
source: QUESTIONS
th: คำถาม

# common_evidence
source: EVIDENCE
th: หลักฐาน

# common_finish
source: FINISH
th: เสร็จสิ้น

# common_start
source: START
th: เริ่ม

# common_restart
source: RESTART
th: เริ่มใหม่

# common_done
source: done
th: เสร็จ

# common_submitting
source: Submitting...
th: กำลังส่งข้อมูล...

# common_score
source: Score
th: คะแนน

# calculate_noAnswer
source: No answer available
th: ไม่มีเฉลย

# calculate_answer
source: ANSWER
th: ตอบ

# calculate_answerAgain
source: ANSWER AGAIN
th: ตอบอีกครั้ง

# calculate_stopBeforeAnswer
source: Stop timer before answering
th: หยุดเวลาก่อนตอบ

# calculate_yourAnswer
source: Your answer: {answer}
th: คำตอบของคุณ: {answer}

# calculate_typeAnswer
source: Type your answer...
th: พิมพ์คำตอบ...

# calculate_diaryNotes
source: DIARY / NOTES
th: บันทึก / โน้ต

# calculate_writeNotes
source: Write your notes here...
th: เขียนบันทึกที่นี่...

# calculate_noQuestions
source: No questions available
th: ไม่มีคำถาม

# calculate_confirmFinishTitle
source: Finish?
th: หยุดจับเวลา?

# calculate_confirmFinishMsg
source: Are you sure you want to finish? You cannot restart the timer.
th: คุณแน่ใจหรือไม่ว่าต้องการหยุด? ไม่สามารถเริ่มจับเวลาใหม่ได้

# calculate_descriptionLabel
source: DESCRIPTION
th: คำอธิบาย

# calculate_solutionLabel
source: Solution:
th: วิธีทำ:

# calculate_correct
source: CORRECT
th: ถูก

# calculate_incorrect
source: INCORRECT
th: ผิด

# record_title
source: RECORD
th: บันทึกเสียง

# itemintro_segmentOf
source: Segment {current} of {total}
th: ข้อ {current} จาก {total}

# itemintro_speak
source: SPEAK
th: พูด

# itemintro_point
source: POINT
th: คะแนน

# itemintro_completed
source: COMPLETED
th: เสร็จแล้ว

# itemintro_pausePlayback
source: PAUSE PLAYBACK...
th: หยุดเล่น...

# itemintro_listenRecording
source: LISTEN TO YOUR RECORDING
th: ฟังเสียงที่บันทึก

# itemintro_recordToPlayback
source: Record to enable playback
th: กดบันทึกเสียงเพื่อฟังเสียงของคุณ

# videodetail_previewNotAvailable
source: Video Preview Not Available
th: ไม่สามารถแสดงตัวอย่างวิดีโอได้

# videodetail_openInBrowser
source: Open in Browser to Watch
th: เปิดในเบราว์เซอร์เพื่อรับชม

# videodetail_openTiktok
source: OPEN TIKTOK
th: เปิด TIKTOK

# videodetail_noVideoUrl
source: No video URL available
th: ไม่มีลิงก์วิดีโอ

# languagehub_appTitle
source: KRATON
th: กระท่อน

# languagehub_fillInBlanksTitle
source: FILL IN THE BLANKS
th: เติมคำในช่องว่าง

# problemplaying_title
source: PROBLEMS SOLVE
th: โจทย์ปัญหา

# problemplaying_resultsTitle
source: PLAYING RESULTS
th: ผลการเล่น

# problemplaying_medalsLabel
source: MEDALS
th: เหรียญรางวัล

# problemplaying_diaryLabel
source: DIARY
th: บันทึก

# problemplaying_diaryHint
source: Write something...
th: เขียนบันทึก...

# problemplaying_imageLabel
source: IMAGE
th: รูปภาพ

# problemplaying_timeLabel
source: TIME
th: เวลา

# problemplaying_answerBtn
source: ANSWER
th: ดูเฉลย

# result_resultTitle
source: RESULT
th: ผลลัพธ์

# result_totalScoreTitle
source: TOTAL SCORE
th: คะแนนรวม

# result_keepTryingTitle
source: KEEP TRYING!
th: สู้ต่อไป!

# result_timeSpentPrefix
source: TIME SPENT:
th: เวลาที่ใช้:

# result_playAgainBtn
source: PLAY AGAIN
th: เล่นอีกครั้ง

# plus_title
source: PLUS +
th: บวก +

# plus_questionTitle
source: QUESTION
th: โจทย์

# plus_startBtn
source: START
th: เริ่ม

# answerplus_title
source: ANSWER PLUS +
th: เฉลย บวก +

# answerplus_questionLabel
source: QUESTION
th: โจทย์

# answerplus_answerLabel
source: ANSWER
th: เฉลย

# email_loginTitle
source: Login with Email
th: เข้าสู่ระบบด้วยอีเมล

# email_registerTitle
source: Register
th: สมัครสมาชิก

# email_emailHint
source: Email
th: อีเมล

# email_passwordHint
source: Password
th: รหัสผ่าน

# email_nameHint
source: Full Name
th: ชื่อ-นามสกุล

# email_loginBtn
source: LOGIN
th: เข้าสู่ระบบ

# email_registerBtn
source: REGISTER
th: สมัครสมาชิก

# email_forgotPassword
source: Forgot Password?
th: ลืมรหัสผ่าน?

# email_noAccount
source: Don't have an account? Register
th: ยังไม่มีบัญชี? สมัครสมาชิก

# email_hasAccount
source: Already have an account? Login
th: มีบัญชีอยู่แล้ว? เข้าสู่ระบบ

# email_resetSent
source: Password reset email sent. Please check your inbox.
th: ส่งอีเมลรีเซ็ตรหัสผ่านแล้ว กรุณาตรวจสอบกล่องจดหมาย

# email_passwordTooShort
source: Password must be at least 6 characters
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

# email_enterEmail
source: Please enter your email
th: กรุณากรอกอีเมล

# email_enterPassword
source: Please enter your password
th: กรุณากรอกรหัสผ่าน

# email_enterName
source: Please enter your name
th: กรุณากรอกชื่อ

# email_forgotTitle
source: Reset Password
th: รีเซ็ตรหัสผ่าน

# email_forgotMsg
source: Enter your email to receive a password reset link.
th: กรอกอีเมลของคุณเพื่อรับลิงก์รีเซ็ตรหัสผ่าน

# email_sendReset
source: SEND
th: ส่ง

# email_loginWithEmail
source: LOGIN WITH EMAIL
th: เข้าสู่ระบบด้วยอีเมล

# email_confirmSent
source: Confirmation email sent. Please check your inbox and click the link to verify, then log in.
th: ส่งอีเมลยืนยันบัญชีแล้ว กรุณาตรวจสอบกล่องจดหมายและคลิกลิงก์เพื่อยืนยัน จากนั้นกลับมาเข้าสู่ระบบ

# email_confirmPasswordHint
source: Confirm Password
th: ยืนยันรหัสผ่าน

# email_passwordsDoNotMatch
source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

# register_childNameHint
source: First - Last Name
th: ชื่อ-นามสกุล

# register_birthdayHint
source: DD/MM/YYYY
th: วว/ดด/ปปปป

# relation_label
source: RELATIONSHIP
th: ความสัมพันธ์

# relation_hint
source: Select relationship
th: เลือกความสัมพันธ์

# relation_parent
source: Father/Mother
th: พ่อ/แม่

# relation_grandparentPaternal
source: Grandfather/Grandmother (Father's side)
th: ปู่/ย่า (ฝ่ายพ่อ)

# relation_grandparentMaternal
source: Grandfather/Grandmother (Mother's side)
th: ตา/ยาย (ฝ่ายแม่)

# relation_auntUncle
source: Aunt/Uncle
th: ลุง/ป้า/น้า/อา

# relation_caregiver
source: Caregiver
th: คนดูแล

# relation_nanny
source: Nanny/Babysitter
th: พี่เลี้ยง

# activityhistory_selectDate
source: Select date
th: เลือกวันที่

# activityhistory_times
source: {count} times
th: {count} ครั้ง

# activityhistory_noHistory
source: No activity history
th: ยังไม่มีประวัติกิจกรรม

# activityhistory_inCategory
source: In {category}
th: ในหมวด {category}

# dailyactivity_playingHistory
source: Playing history
th: ประวัติการเล่น

# dailyactivity_noData
source: No data
th: ไม่มีข้อมูล

# dailyactivity_activity
source: Activity
th: กิจกรรม

# childprofile_language
source: Language
th: ด้านภาษา

# childprofile_physical
source: Physical
th: ด้านร่างกาย

# childprofile_calculation
source: Calculation
th: ด้านคำนวณ

# childprofile_unknownName
source: Unknown
th: ไม่ระบุชื่อ

# childprofile_noHistory
source: No activity history
th: ยังไม่มีประวัติกิจกรรม

# childprofile_startPlaying
source: Start playing activities to see stats here
th: เริ่มเล่นกิจกรรมเพื่อดูสถิติที่นี่

# childprofile_totalActivities
source: Total activities
th: กิจกรรมทั้งหมด

# childprofile_times
source: times
th: ครั้ง

# medalredemption_activity
source: Activity
th: กิจกรรม

# medalredemption_done
source: DONE
th: เสร็จสิ้น

# medalredemption_points
source: points
th: คะแนน

# playingresult_activity
source: Activity
th: กิจกรรม

# playingresult_title
source: Playing result
th: ผลการเล่น

# playingresult_session
source: Session {number}
th: ครั้งที่ {number}

# playingresult_scoreObtained
source: Score obtained
th: คะแนนที่ได้

# playingresult_diary
source: Diary
th: บันทึก

# playingresult_noNotes
source: No notes
th: ไม่มีบันทึก

# playingresult_image
source: Image
th: รูปภาพ

# playingresult_video
source: Video
th: วิดีโอ

# playingresult_videoAttached
source: Video attached
th: มีวิดีโอแนบ

# playingresult_timeSpent
source: Time spent
th: เวลาที่ใช้

# playingresult_noImage
source: No image
th: ไม่มีรูปภาพ

# playingresult_sentencesSpoken
source: Sentences spoken
th: ประโยคที่พูด

# playingresult_sentence
source: Sentence {number}
th: ประโยค {number}

# playingresult_sentenceToSpeak
source: Sentence to speak:
th: ประโยคที่ต้องพูด:

# playingresult_whatWasSpoken
source: What was spoken:
th: สิ่งที่พูด:

# playingresult_noData
source: (No data)
th: (ไม่มีข้อมูล)

# playingresult_noSpeechData
source: No speech data
th: ไม่มีข้อมูลการพูด

# playingresult_answerResults
source: Answer results
th: ผลการตอบคำถาม

# playingresult_questionLabel
source: Q.{number}
th: ข้อ {number}

# playingresult_questionFallback
source: Question {number}
th: คำถามข้อ {number}
